<template>
    <v-layout row wrap class="mt-4">
        <v-flex xs12 md10 offset-md1 lg8 offset-lg2 v-for="(item, key) in items" :key="key" justify-center>
            <v-card flat v-apparate:fadeInUp="{y:0}" class="mb-5 blue-grey--text text--darken-2">
                <v-layout row wrap>
                    <v-flex xs12 md5>
                        <v-card-media :src="item.image" style="height:100%; min-height:460px;">
                        </v-card-media>
                    </v-flex>
                    <v-flex xs12 md7 class="pa-5"> <div>
                        <p class="headline text-xs-center">{{item.name}}</p>
                        <v-divider class="ma-1"/>
                        <p style="font-weight: 300; font-size: 1.3em;" class="grey--text text-xs-center">{{item.subtitle}}</p>
                    </div>
                        <div style="font-size: 1.2em;" class="mt-4" v-html="item.info"></div>
                    </v-flex>
                </v-layout>
            </v-card>
            <!--<v-card style="max-width: 300px;">-->
            <!--<v-card-media src="public/gold_bages/saltanat.jpg" height="320px"></v-card-media>-->
            <!--<v-card-title primary-title  class="pa-4">-->
            <!--<div>-->
            <!--<p class="headline ma-0 pa-0">{{item.name}}</p>-->
            <!--<p style="text-align: right; font-weight: 500;" class="grey&#45;&#45;text">{{item.subtitle}}</p>-->
            <!--<v-divider/>-->
            <!--<div class="mt-3" v-html="item.info"></div>-->
            <!--</div>-->
            <!--</v-card-title>-->
            <!--</v-card>-->
        </v-flex>
    </v-layout>
</template>

<script>
    export default {
        data() {
            return {
                items: [
                    {
                        name: 'Омиржанова Сайран Еспаевна',
                        image: 'public/natizhe/ose.jpeg',
                        subtitle: 'Биология және химия пәндерінің мұғалімі',
                        info: '«Биология және салауаттылық негізі»  республикалық ғылыми - педагогикалық  журналының оқырманы;<br>' +
                        '«Биология  Қазақстан  мектебінде» республикалық  ғылыми - әдістемелік   журналының   оқырманы;<br><br>' +
                        '10 сыныпқа арналған «Қазақстанның өсімдіктер әлемі, тіршілік үрдісін қарапайым математикалық  модельдеу» - қолданбалы курсының авторы;  <br>' +
                        '6 сыныпқа арналған «Өсімдіктің ішкі дүниесі»<br>' +
                        'таңдау курсының авторы; <br><br>' +
                        'Қала «Ең үздік биология кабинеті» номинация «Жаңашыл», Респ білім шыңы жобасы Төсбелгі, грамота.<br>' +
                        'Қала «Ең үздік педагог» -І орын.<br><br>' +
                        'Мұғалімге диплом 2 дәрежелі халықаралық пәндер негізі  олимпиадасы.<br>' +
                        'Республикалық «Үздік педагог-2016» жеңімпазы.'
                    },
                    {
                        name: 'Аханова Айзада Бекеновна',
                        image: 'public/natizhe/aab.jpeg',
                        subtitle: 'Орыс тілі мен әдебиеті пәнінің мұғалімі',
                        info: 'Айзада Бекенқызы өзінің кәсіби шеберлігін шыңдау мақсатында   педагогикалық сайыстарға белсенді түрде қатысып жүлделі орындарды иеленген: қалалық «Үздік ұйымдастырушы-тәрбиеші 2010» ІІ орын, «Үздік педагог-2017» ІІ орын.<br><br>' +
                        'Мұғалім оңтайлы педагогикалық тәжірибесін тарату мақсатында бірнеше авторлық әзірлемелерін облыс деңгейінде қорғаған: «Рабочая тетрадь по литературному чтению для 6 класса» 2014 г. ISBN №978-601-7479-97-7 УДК3702; «Электронное пособие для классных руководителей» 2017 г;  «Электронное пособие по литературному чтению для 7 класса» 24 февраля 2017, серия АА №646; «Прикладной курс делового общения для учащихся 10-11 класса» 24 февраля 2017 г. серия АА №645. Сонымен қатар мұғалім ғылыми ізденістерімен республикалық әдістемелік журнал беттерінде бөлісіп отырады: «Білім кілті», «Открытая школа», «Қазақстанның білім және ғылым әлемі».'
                    },
                    {
                        name: 'Бектенов Галинур Суйментаевич',
                        image: 'public/natizhe/bgs.jpeg',
                        subtitle: 'Дене шынықтыру пәнінің мұғалімі',
                        info: 'Қостанай облысы Рудный қаласы бойынша «Асық ату» жаттықтырушысы.<br><br>' +
                        '2015ж «Қалалық спорт бөлімі»ММ денешынықтыру және спортқа қосқан үлесі үшін мадақтама.<br><br>' +
                        '2016ж Мектеп және колледж оқушылары арасындағы VIII республикалық фестивалінің 3 орын иегерлерін дайындғаны үшін.<br><br>' +
                        '2016ж Облыстық дене шынықтыру және спорт бөлімі «Алғыс хат»<br><br>' +
                        '2017ж Облыстық «Асық ату» федерациясынан «Үздік жаттықтырушы» Алғыс хат.'
                    },
                    {
                        name: 'Қожахметов Олжас Карбозович',
                        image: 'public/natizhe/kok.jpeg',
                        subtitle: 'Дене шынықтыру пәнінің  мұғалімі',
                        info: ' Асық ойыны спортынан ҚР кубогіне арналған жарыста 2 орын;<br><br>' +
                        'Асық ойыны спортынан Қазақстан Республикасының Чемпионатыда 3 орын;<br><br>' +
                        'VIII облыстық ұлтық ойыны «Асық атудан» 1 орын;<br><br>' +
                        'Жас мамандар арасында өткен  облыстық байқауда «Урок, которым я горжусь!» І орын иеленді.'
                    }
                ]
            }
        }
    }
</script>