<template>
<v-layout row wrap style="margin-top: 160px; margin-bottom: 60px;">
    <v-flex xs12 md8 offset-md2 lg6 offset-lg3>
        <img src="public/bileti_pdd.jpeg" style="position: fixed; left:0; top: 50px; width: 100%;"/>

        <!--<div style="position: fixed; left: 0; top:60px; width:100%;">-->
            <!--<v-parallax src="public/bileti_pdd.jpeg" height="300" style="width: 100%;"></v-parallax>-->
        <!--</div>-->
        <v-card flat class="pa-5 blue-grey--text text--darken-2"  v-apparate:fadeInUp="{y:200}">
            <v-card-title class="text-bigger">
                <p class="headline">
                    ЖОЛДА ЖҮРУ ЕРЕЖЕСІ БОЙЫНША БАЯНДАМА
                </p>
                <p>
                    Қоғам үшін баланың денсаулығы мен өмірінің қауіпсіздігі- ең басты байлық. Сондықтан мектептерде жолда жүру ережелеріне үлкен көңіл бөлінуде. Статистика бойынша, өкінішке орай , жол апаттары көптеп болуда. Соның ішінде балалардың жол апатына душар болуы жоғары көрсеткішті көрсетеді.
                    <br>
                    <br>
                    Сол себепті балалардың өмірінің қауіпсіздігі дағдыларын мектепке дейінгі кезеңде қалыптастыру қажет. Жол заңы дұрыс жүріп, абай болуды талап етеді. Жол тәртібін бұзба, ол қатер тудырады. Жолдың қалыпты қозғалысы көбінесе балалардың жол бойында қалай болса солай жүріп, доп қуалайтыны, жүріп бара жатқан машинаға жабысатыны, қалтарыстан жолға шығып келетіні салдарынан бұзылады. Және бағдаршам істен шыққан уақытта қалай жүру керектігін білмегендіктен болады. Жол тәртібін бұзғандықтан кейбірулер машина дөңгелегіне ілініп қаза тауып, кейбіреулері жарақат алады. Кейбіреулері өмірлік мүгедек болып қалады.
                    <br>
                    <br>
                    Балалар жолда жүру заңын сіз бен бізден үйренеді. Балалар үлкендердің жүріс-тұрысының жақсы жағын да, жаман жағын да қабылдайды. Көп жағдайда балалар жолда жарақат алып, түрлі жағдайға ұшырап жататыны көлік жүргізушілерінің ғана кінәсінен емес, ол көбінесе балалардың жол жүру ережесін білмегендіктен болады. Балаларға жолда жүру ережелерін үйретіп, үнемі оған үлгі көрсетіп және жүріс-тұрысын қадағалап, балаларды көшеде болатын қауіпті жағдайлардан сақтандыру әрбір ата-ананың міндеті.
                    <br>
                    <br>
                    Мектеп және мектепке дейінгі мекемелерде балаларға арнап «Жолда жүру ережесі» тақырыбында оқу іс-әрекеттері және түрлі шаралар ұйымдастырылып өткізіледі. Сондықтан әрбір бала үйретілетін «Жолда жүру ережесі» тақырыбындағы іс-әрекетті мұқият тыңдап, өткізілген іс-әрекеттен қорытынды жасап отыруға міндетті. Балаларды жолда жүру ережелерімен таныстыру мақсатында ойындар, әңгімелер, серуен кезіндегі ойын түрлері, конкурстар, сұрақ-жауаптарды кеңінен қолдану, балалардың жол ережесі туралы түсініктерінің қалыптасуы мен білімдерінің жетілуіне көмектеседі.
                    <br>
                    <br>
                    Балаларды жол жүру ережелеріне үйрету- ата-ана мен үлкендердің тұрақты, үздіксіз жұмысы. Бағдаршам белгілерімен, жолда жүру ережелерімен, жаяу жүргіншілер жолы, көше жиегіндегі жолдармен (тротуармен) таныстыруды жүзеге асыру көзделген. Балалар өмірінің қауіпсіздігін қамтамасыз ету үшін , оларды жол жарақаттарынан сақтау үшін алдымен жолда, көшеде жүру ережелерін, жолда жүру тәртібін үйретуіміз керек. Үйде ата-ана, мектепке дейінгі ұйымда балабақша тәрбиешілері бірлесіп, балаларға жол ережелері туралы үйретер болсақ, балалар жол апатының алдын алар едік.
                </p>
                <p>
                    <b>Құрметті ата-аналар мен ересектер!</b>
                    <br>
                    Балалық жол-көлік жарақаттары еңауыр, бірақ олармен балаларды қорқытуға болмайды. Үлкендердің мақсаты-көшедегі тәртіп ережелерін баласына үйрету және олар үшін өнеге болу.
                    <br>
                    <br>
                    <b>Есте сақтаңыз:</b>
                    <br>
                    Кішкентай жүргіншілер жақсы мен жаманды үлкендерден үйренеді. Сондықтан әрқашан және барлық жерде қызу қозғалыстағы қала көшелерінде, тар ауыл аралық жолда «Жол қозғалыс ережелерін» сақтаңыз.
                    <br>
                    <br>
                    <b>Білгеніміз жөн!</b>
                    <br>
                    Балалардың жол үстінде қайғылы оқиғаларға ұшырауының негізгі себебі-жол қозғалысының қарапайым ережелерін сақтамау болып табылады. Өз қауіпсіздігің үшін мына ережелерді мықтап есте сақта!
                </p>
                <p>
                        · Жүріп бара жатқан автобус не маршруттық таксиде барлық кезде тұтқадан ұстап тұр.
                    <br>
                    <br>
                        · Ролик, велосипед және скейтборд тепкенде мұқият және абай бол.
                    <br>
                    <br>
                        · Жолдың арғы бетіне тек бағдаршам тұрған немесе жаяу жүргінші өтетін жерден өт.
                    <br>
                    <br>
                        · Тек қана бағдаршамның жасыл түсі жанғанда ғана жолдан өт.
                    <br>
                    <br>
                        · Жүріп бара жатқан көлік алдынан кесіп өтпе.
                    <br>
                    <br>
                        · Жолдың көлік жүретін бөлігінде ойнама.
                    <br>
                    <br>
                        · Егер жаяу жүргінші жүретін жол жоқ болса, онда көлік қозғалысына қарама- қарсы жолдың оң жағымен жүр.
               </p>
            </v-card-title>
        </v-card>
    </v-flex>
</v-layout>
</template>

<style>
    .text-bigger p {
        font-size: 1.3em;
        text-align: justify;
    }
</style>