<template>
    <v-card class="pa-4">
        <v-card-title>
            <h2 class="mb-2">{{history}}</h2>
        </v-card-title>
        <v-layout row wrap style="max-width:900px">
            <template v-for="item in items">
                <v-flex xs2 class="text-xs-center mt-3">
                    <h4>{{item.title}}</h4>
                </v-flex>
                <v-flex xs10 class="mt-3">{{item.text}}</v-flex>
            </template>
        </v-layout>
    </v-card>
</template>

<script>
    export default {
        data() {
            return {
                history: 'Мектеп тарихы',
                items:[
                    {
                        title: '1965',
                        text:'мектептің ашылуы'
                    },
                    {
                        title: '1966 ',
                        text:'тұңғыш оқушылар түлегі'
                    },
                    {
                        title: '1978',
                        text:'математиканы тереңдетіп оқитын сыныптың ашылуы'
                    },
                    {
                        title: '1985',
                        text:'тәжірибе – бақылау сыныбының ашылуы'
                    },
                    {
                        title: '1990-1991 ',
                        text:'№12 орыс мектебінде мемлекеттік тілде оқытатын сынып ашылды. Мектептің ашылуына бірден бір мұрындық болған Омар Төртбаев, 1990-1991 оқу жылына баратын балалардың тізімін алып, үйді үйге жүріп, үгіт-насихат жүргізді. Ақыр аяғы «ұлтымызды, тілімізді қайтарайық» деп қабат-қабат үйлерді жаяу аралаған Омар ата сол жылы он баланың басын қосып, ең алғашқы мұғалімі болған Әлия Әліпованың қолына табыс етті'
                    },
                    {
                        title: '1993-1994 ',
                        text:'оқу жылында қазақ сыныптары №15 орта мектебінде жеке шаңырақ көтерді'
                    },
                    {
                        title: '1997',
                        text:'жылы қайтадан орта мектептің ашылуы. Мектептің алғашқы директоры болып Зоя Көбейқызы Есмуханбетова тағайындалды. Мектептің алғашқы ұстаздары Байкенова Ғ.Қ., Қыстаубаева С.К., Бірімжанова А.К., Кенжетаева Ү.Ж.'
                    },
                    {
                        title: '2000',
                        text:'жылы мектеп директоры болып Серік Қайырқанұлы Мырзахметов тағайындалды'
                    },
                    {
                        title: '2001',
                        text:'жылы мектеп бірінші түлектерін мектеп қабырғасынан шығарды. Ал Омар ақсақалдың жинаған алғашқы қарлығаштары бүгінде еліміздің Астана, Алматы сынды ірі қалаларында жұмыс жасауда (Б.Жұрқабаева, Е.Қалдыбиев, Қ.Қырықбаева).'
                    },
                    {
                        title: '2003',
                        text:'мектептің он жылдығы тойланды'
                    },
                    {
                        title: '2004',
                        text:'мектеп директоры болып Қайыржан Рақымжанұлы Нұрмағанбетов тағайындалды. №15 қазақ орта мектебінің шаңырақ көтергеніне 15 жылдан асып барады'
                    },
                    {
                        title: '2006',
                        text:'№15 орта мектепте қазақ мектебінің кірпішін қалауға негіз болған құдіретті азамат – Омар Төртбаевтың еңбегі өз бағасына ие болып, Омар Оспанұлына арналған ескерткіш тақта ашылды'
                    },
                    {
                        title: '2009',
                        text:'мектеп директоры болып Қымбат Исламбекқызы Бірманова тағайындалды'
                    },  {
                        title: '2011',
                        text:'мектеп директоры болып Қайыржан Рақымжанұлы Нұрмағанбетов тағайындалды'
                    }
                ]
            }
        },
    }
</script>